Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/sdmmc.h
#define SDMMC_SRR_SWRSTALL_Pos                _UINT8_(0)                                           /* (SDMMC_SRR) Software Reset For All Position */
#define SDMMC_SRR_SWRSTALL_Msk                (_UINT8_(0x1) << SDMMC_SRR_SWRSTALL_Pos)             /* (SDMMC_SRR) Software Reset For All Mask */
#define SDMMC_SRR_SWRSTALL(value)             (SDMMC_SRR_SWRSTALL_Msk & (_UINT8_(value) << SDMMC_SRR_SWRSTALL_Pos)) /* Assigment of value for SWRSTALL in the SDMMC_SRR register */
#define   SDMMC_SRR_SWRSTALL_WORK_Val         _UINT8_(0x0)                                         /* (SDMMC_SRR) Work  */
#define   SDMMC_SRR_SWRSTALL_RESET_Val        _UINT8_(0x1)                                         /* (SDMMC_SRR) Reset  */
#define SDMMC_SRR_SWRSTALL_WORK               (SDMMC_SRR_SWRSTALL_WORK_Val << SDMMC_SRR_SWRSTALL_Pos) /* (SDMMC_SRR) Work Position  */
#define SDMMC_SRR_SWRSTALL_RESET              (SDMMC_SRR_SWRSTALL_RESET_Val << SDMMC_SRR_SWRSTALL_Pos) /* (SDMMC_SRR) Reset Position  */
#define SDMMC_SRR_SWRSTCMD_Pos                _UINT8_(1)                                           /* (SDMMC_SRR) Software Reset For CMD Line Position */
#define SDMMC_SRR_SWRSTCMD_Msk                (_UINT8_(0x1) << SDMMC_SRR_SWRSTCMD_Pos)             /* (SDMMC_SRR) Software Reset For CMD Line Mask */
#define SDMMC_SRR_SWRSTCMD(value)             (SDMMC_SRR_SWRSTCMD_Msk & (_UINT8_(value) << SDMMC_SRR_SWRSTCMD_Pos)) /* Assigment of value for SWRSTCMD in the SDMMC_SRR register */
#define   SDMMC_SRR_SWRSTCMD_WORK_Val         _UINT8_(0x0)                                         /* (SDMMC_SRR) Work  */
#define   SDMMC_SRR_SWRSTCMD_RESET_Val        _UINT8_(0x1)                                         /* (SDMMC_SRR) Reset  */
#define SDMMC_SRR_SWRSTCMD_WORK               (SDMMC_SRR_SWRSTCMD_WORK_Val << SDMMC_SRR_SWRSTCMD_Pos) /* (SDMMC_SRR) Work Position  */
#define SDMMC_SRR_SWRSTCMD_RESET              (SDMMC_SRR_SWRSTCMD_RESET_Val << SDMMC_SRR_SWRSTCMD_Pos) /* (SDMMC_SRR) Reset Position  */
#define SDMMC_SRR_SWRSTDAT_Pos                _UINT8_(2)                                           /* (SDMMC_SRR) Software Reset For DAT Line Position */
#define SDMMC_SRR_SWRSTDAT_Msk                (_UINT8_(0x1) << SDMMC_SRR_SWRSTDAT_Pos)             /* (SDMMC_SRR) Software Reset For DAT Line Mask */
#define SDMMC_SRR_SWRSTDAT(value)             (SDMMC_SRR_SWRSTDAT_Msk & (_UINT8_(value) << SDMMC_SRR_SWRSTDAT_Pos)) /* Assigment of value for SWRSTDAT in the SDMMC_SRR register */
#define   SDMMC_SRR_SWRSTDAT_WORK_Val         _UINT8_(0x0)                                         /* (SDMMC_SRR) Work  */
#define   SDMMC_SRR_SWRSTDAT_RESET_Val        _UINT8_(0x1)                                         /* (SDMMC_SRR) Reset  */
#define SDMMC_SRR_SWRSTDAT_WORK               (SDMMC_SRR_SWRSTDAT_WORK_Val << SDMMC_SRR_SWRSTDAT_Pos) /* (SDMMC_SRR) Work Position  */
#define SDMMC_SRR_SWRSTDAT_RESET              (SDMMC_SRR_SWRSTDAT_RESET_Val << SDMMC_SRR_SWRSTDAT_Pos) /* (SDMMC_SRR) Reset Position  */
#define SDMMC_SRR_Msk                         _UINT8_(0x07)                                        /* (SDMMC_SRR) Register Mask  */


/* -------- SDMMC_NISTR : (SDMMC Offset: 0x30) (R/W 16) Normal Interrupt Status -------- */
#define SDMMC_NISTR_RESETVALUE                _UINT16_(0x00)                                       /*  (SDMMC_NISTR) Normal Interrupt Status  Reset Value */

#define SDMMC_NISTR_CMDC_Pos                  _UINT16_(0)                                          /* (SDMMC_NISTR) Command Complete Position */
#define SDMMC_NISTR_CMDC_Msk                  (_UINT16_(0x1) << SDMMC_NISTR_CMDC_Pos)              /* (SDMMC_NISTR) Command Complete Mask */
#define SDMMC_NISTR_CMDC(value)               (SDMMC_NISTR_CMDC_Msk & (_UINT16_(value) << SDMMC_NISTR_CMDC_Pos)) /* Assigment of value for CMDC in the SDMMC_NISTR register */
#define   SDMMC_NISTR_CMDC_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_NISTR) No command complete  */
#define   SDMMC_NISTR_CMDC_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_NISTR) Command complete  */
#define SDMMC_NISTR_CMDC_NO                   (SDMMC_NISTR_CMDC_NO_Val << SDMMC_NISTR_CMDC_Pos)    /* (SDMMC_NISTR) No command complete Position  */
#define SDMMC_NISTR_CMDC_YES                  (SDMMC_NISTR_CMDC_YES_Val << SDMMC_NISTR_CMDC_Pos)   /* (SDMMC_NISTR) Command complete Position  */
#define SDMMC_NISTR_TRFC_Pos                  _UINT16_(1)                                          /* (SDMMC_NISTR) Transfer Complete Position */
#define SDMMC_NISTR_TRFC_Msk                  (_UINT16_(0x1) << SDMMC_NISTR_TRFC_Pos)              /* (SDMMC_NISTR) Transfer Complete Mask */
#define SDMMC_NISTR_TRFC(value)               (SDMMC_NISTR_TRFC_Msk & (_UINT16_(value) << SDMMC_NISTR_TRFC_Pos)) /* Assigment of value for TRFC in the SDMMC_NISTR register */
#define   SDMMC_NISTR_TRFC_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_NISTR) Not complete  */
#define   SDMMC_NISTR_TRFC_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_NISTR) Command execution is completed  */
#define SDMMC_NISTR_TRFC_NO                   (SDMMC_NISTR_TRFC_NO_Val << SDMMC_NISTR_TRFC_Pos)    /* (SDMMC_NISTR) Not complete Position  */
#define SDMMC_NISTR_TRFC_YES                  (SDMMC_NISTR_TRFC_YES_Val << SDMMC_NISTR_TRFC_Pos)   /* (SDMMC_NISTR) Command execution is completed Position  */
#define SDMMC_NISTR_BLKGE_Pos                 _UINT16_(2)                                          /* (SDMMC_NISTR) Block Gap Event Position */
#define SDMMC_NISTR_BLKGE_Msk                 (_UINT16_(0x1) << SDMMC_NISTR_BLKGE_Pos)             /* (SDMMC_NISTR) Block Gap Event Mask */
#define SDMMC_NISTR_BLKGE(value)              (SDMMC_NISTR_BLKGE_Msk & (_UINT16_(value) << SDMMC_NISTR_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDMMC_NISTR register */
#define   SDMMC_NISTR_BLKGE_NO_Val            _UINT16_(0x0)                                        /* (SDMMC_NISTR) No Block Gap Event  */
#define   SDMMC_NISTR_BLKGE_STOP_Val          _UINT16_(0x1)                                        /* (SDMMC_NISTR) Transaction stopped at block gap  */
#define SDMMC_NISTR_BLKGE_NO                  (SDMMC_NISTR_BLKGE_NO_Val << SDMMC_NISTR_BLKGE_Pos)  /* (SDMMC_NISTR) No Block Gap Event Position  */
#define SDMMC_NISTR_BLKGE_STOP                (SDMMC_NISTR_BLKGE_STOP_Val << SDMMC_NISTR_BLKGE_Pos) /* (SDMMC_NISTR) Transaction stopped at block gap Position  */
#define SDMMC_NISTR_DMAINT_Pos                _UINT16_(3)                                          /* (SDMMC_NISTR) DMA Interrupt Position */
#define SDMMC_NISTR_DMAINT_Msk                (_UINT16_(0x1) << SDMMC_NISTR_DMAINT_Pos)            /* (SDMMC_NISTR) DMA Interrupt Mask */
#define SDMMC_NISTR_DMAINT(value)             (SDMMC_NISTR_DMAINT_Msk & (_UINT16_(value) << SDMMC_NISTR_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDMMC_NISTR register */
#define   SDMMC_NISTR_DMAINT_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_NISTR) No DMA Interrupt  */
#define   SDMMC_NISTR_DMAINT_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_NISTR) DMA Interrupt is generated  */
#define SDMMC_NISTR_DMAINT_NO                 (SDMMC_NISTR_DMAINT_NO_Val << SDMMC_NISTR_DMAINT_Pos) /* (SDMMC_NISTR) No DMA Interrupt Position  */
#define SDMMC_NISTR_DMAINT_YES                (SDMMC_NISTR_DMAINT_YES_Val << SDMMC_NISTR_DMAINT_Pos) /* (SDMMC_NISTR) DMA Interrupt is generated Position  */
#define SDMMC_NISTR_BWRRDY_Pos                _UINT16_(4)                                          /* (SDMMC_NISTR) Buffer Write Ready Position */
#define SDMMC_NISTR_BWRRDY_Msk                (_UINT16_(0x1) << SDMMC_NISTR_BWRRDY_Pos)            /* (SDMMC_NISTR) Buffer Write Ready Mask */
#define SDMMC_NISTR_BWRRDY(value)             (SDMMC_NISTR_BWRRDY_Msk & (_UINT16_(value) << SDMMC_NISTR_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDMMC_NISTR register */
#define   SDMMC_NISTR_BWRRDY_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_NISTR) Not ready to write buffer  */
#define   SDMMC_NISTR_BWRRDY_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_NISTR) Ready to write buffer  */
#define SDMMC_NISTR_BWRRDY_NO                 (SDMMC_NISTR_BWRRDY_NO_Val << SDMMC_NISTR_BWRRDY_Pos) /* (SDMMC_NISTR) Not ready to write buffer Position  */
#define SDMMC_NISTR_BWRRDY_YES                (SDMMC_NISTR_BWRRDY_YES_Val << SDMMC_NISTR_BWRRDY_Pos) /* (SDMMC_NISTR) Ready to write buffer Position  */
#define SDMMC_NISTR_BRDRDY_Pos                _UINT16_(5)                                          /* (SDMMC_NISTR) Buffer Read Ready Position */
#define SDMMC_NISTR_BRDRDY_Msk                (_UINT16_(0x1) << SDMMC_NISTR_BRDRDY_Pos)            /* (SDMMC_NISTR) Buffer Read Ready Mask */
#define SDMMC_NISTR_BRDRDY(value)             (SDMMC_NISTR_BRDRDY_Msk & (_UINT16_(value) << SDMMC_NISTR_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDMMC_NISTR register */
#define   SDMMC_NISTR_BRDRDY_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_NISTR) Not ready to read buffer  */
#define   SDMMC_NISTR_BRDRDY_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_NISTR) Ready to read buffer  */
#define SDMMC_NISTR_BRDRDY_NO                 (SDMMC_NISTR_BRDRDY_NO_Val << SDMMC_NISTR_BRDRDY_Pos) /* (SDMMC_NISTR) Not ready to read buffer Position  */
#define SDMMC_NISTR_BRDRDY_YES                (SDMMC_NISTR_BRDRDY_YES_Val << SDMMC_NISTR_BRDRDY_Pos) /* (SDMMC_NISTR) Ready to read buffer Position  */
#define SDMMC_NISTR_CINS_Pos                  _UINT16_(6)                                          /* (SDMMC_NISTR) Card Insertion Position */
#define SDMMC_NISTR_CINS_Msk                  (_UINT16_(0x1) << SDMMC_NISTR_CINS_Pos)              /* (SDMMC_NISTR) Card Insertion Mask */
#define SDMMC_NISTR_CINS(value)               (SDMMC_NISTR_CINS_Msk & (_UINT16_(value) << SDMMC_NISTR_CINS_Pos)) /* Assigment of value for CINS in the SDMMC_NISTR register */
#define   SDMMC_NISTR_CINS_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_NISTR) Card state stable or Debouncing  */
#define   SDMMC_NISTR_CINS_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_NISTR) Card inserted  */
#define SDMMC_NISTR_CINS_NO                   (SDMMC_NISTR_CINS_NO_Val << SDMMC_NISTR_CINS_Pos)    /* (SDMMC_NISTR) Card state stable or Debouncing Position  */
#define SDMMC_NISTR_CINS_YES                  (SDMMC_NISTR_CINS_YES_Val << SDMMC_NISTR_CINS_Pos)   /* (SDMMC_NISTR) Card inserted Position  */
#define SDMMC_NISTR_CREM_Pos                  _UINT16_(7)                                          /* (SDMMC_NISTR) Card Removal Position */
#define SDMMC_NISTR_CREM_Msk                  (_UINT16_(0x1) << SDMMC_NISTR_CREM_Pos)              /* (SDMMC_NISTR) Card Removal Mask */
#define SDMMC_NISTR_CREM(value)               (SDMMC_NISTR_CREM_Msk & (_UINT16_(value) << SDMMC_NISTR_CREM_Pos)) /* Assigment of value for CREM in the SDMMC_NISTR register */
#define   SDMMC_NISTR_CREM_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_NISTR) Card state stable or Debouncing  */
#define   SDMMC_NISTR_CREM_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_NISTR) Card Removed  */
#define SDMMC_NISTR_CREM_NO                   (SDMMC_NISTR_CREM_NO_Val << SDMMC_NISTR_CREM_Pos)    /* (SDMMC_NISTR) Card state stable or Debouncing Position  */
#define SDMMC_NISTR_CREM_YES                  (SDMMC_NISTR_CREM_YES_Val << SDMMC_NISTR_CREM_Pos)   /* (SDMMC_NISTR) Card Removed Position  */
#define SDMMC_NISTR_CINT_Pos                  _UINT16_(8)                                          /* (SDMMC_NISTR) Card Interrupt Position */
#define SDMMC_NISTR_CINT_Msk                  (_UINT16_(0x1) << SDMMC_NISTR_CINT_Pos)              /* (SDMMC_NISTR) Card Interrupt Mask */
#define SDMMC_NISTR_CINT(value)               (SDMMC_NISTR_CINT_Msk & (_UINT16_(value) << SDMMC_NISTR_CINT_Pos)) /* Assigment of value for CINT in the SDMMC_NISTR register */
#define   SDMMC_NISTR_CINT_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_NISTR) No Card Interrupt  */
#define   SDMMC_NISTR_CINT_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_NISTR) Generate Card Interrupt  */
#define SDMMC_NISTR_CINT_NO                   (SDMMC_NISTR_CINT_NO_Val << SDMMC_NISTR_CINT_Pos)    /* (SDMMC_NISTR) No Card Interrupt Position  */
#define SDMMC_NISTR_CINT_YES                  (SDMMC_NISTR_CINT_YES_Val << SDMMC_NISTR_CINT_Pos)   /* (SDMMC_NISTR) Generate Card Interrupt Position  */
#define SDMMC_NISTR_ERRINT_Pos                _UINT16_(15)                                         /* (SDMMC_NISTR) Error Interrupt Position */
#define SDMMC_NISTR_ERRINT_Msk                (_UINT16_(0x1) << SDMMC_NISTR_ERRINT_Pos)            /* (SDMMC_NISTR) Error Interrupt Mask */
#define SDMMC_NISTR_ERRINT(value)             (SDMMC_NISTR_ERRINT_Msk & (_UINT16_(value) << SDMMC_NISTR_ERRINT_Pos)) /* Assigment of value for ERRINT in the SDMMC_NISTR register */
#define   SDMMC_NISTR_ERRINT_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_NISTR) No Error  */
#define   SDMMC_NISTR_ERRINT_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_NISTR) Error  */
#define SDMMC_NISTR_ERRINT_NO                 (SDMMC_NISTR_ERRINT_NO_Val << SDMMC_NISTR_ERRINT_Pos) /* (SDMMC_NISTR) No Error Position  */
#define SDMMC_NISTR_ERRINT_YES                (SDMMC_NISTR_ERRINT_YES_Val << SDMMC_NISTR_ERRINT_Pos) /* (SDMMC_NISTR) Error Position  */
#define SDMMC_NISTR_Msk                       _UINT16_(0x81FF)                                     /* (SDMMC_NISTR) Register Mask  */

/* EMMC mode */
#define SDMMC_NISTR_EMMC_BOOTAR_Pos           _UINT16_(14)                                         /* (SDMMC_NISTR) Boot Acknowledge Received Position */
#define SDMMC_NISTR_EMMC_BOOTAR_Msk           (_UINT16_(0x1) << SDMMC_NISTR_EMMC_BOOTAR_Pos)       /* (SDMMC_NISTR) Boot Acknowledge Received Mask */
#define SDMMC_NISTR_EMMC_BOOTAR(value)        (SDMMC_NISTR_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDMMC_NISTR_EMMC_BOOTAR_Pos))
#define SDMMC_NISTR_EMMC_Msk                  _UINT16_(0x4000)                                      /* (SDMMC_NISTR_EMMC) Register Mask  */


