Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/sdmmc.h
/* -------- SDMMC_NISTER : (SDMMC Offset: 0x34) (R/W 16) Normal Interrupt Status Enable -------- */
#define SDMMC_NISTER_RESETVALUE               _UINT16_(0x00)                                       /*  (SDMMC_NISTER) Normal Interrupt Status Enable  Reset Value */

#define SDMMC_NISTER_CMDC_Pos                 _UINT16_(0)                                          /* (SDMMC_NISTER) Command Complete Status Enable Position */
#define SDMMC_NISTER_CMDC_Msk                 (_UINT16_(0x1) << SDMMC_NISTER_CMDC_Pos)             /* (SDMMC_NISTER) Command Complete Status Enable Mask */
#define SDMMC_NISTER_CMDC(value)              (SDMMC_NISTER_CMDC_Msk & (_UINT16_(value) << SDMMC_NISTER_CMDC_Pos)) /* Assigment of value for CMDC in the SDMMC_NISTER register */
#define   SDMMC_NISTER_CMDC_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_CMDC_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_CMDC_MASKED              (SDMMC_NISTER_CMDC_MASKED_Val << SDMMC_NISTER_CMDC_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_CMDC_ENABLED             (SDMMC_NISTER_CMDC_ENABLED_Val << SDMMC_NISTER_CMDC_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_TRFC_Pos                 _UINT16_(1)                                          /* (SDMMC_NISTER) Transfer Complete Status Enable Position */
#define SDMMC_NISTER_TRFC_Msk                 (_UINT16_(0x1) << SDMMC_NISTER_TRFC_Pos)             /* (SDMMC_NISTER) Transfer Complete Status Enable Mask */
#define SDMMC_NISTER_TRFC(value)              (SDMMC_NISTER_TRFC_Msk & (_UINT16_(value) << SDMMC_NISTER_TRFC_Pos)) /* Assigment of value for TRFC in the SDMMC_NISTER register */
#define   SDMMC_NISTER_TRFC_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_TRFC_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_TRFC_MASKED              (SDMMC_NISTER_TRFC_MASKED_Val << SDMMC_NISTER_TRFC_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_TRFC_ENABLED             (SDMMC_NISTER_TRFC_ENABLED_Val << SDMMC_NISTER_TRFC_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_BLKGE_Pos                _UINT16_(2)                                          /* (SDMMC_NISTER) Block Gap Event Status Enable Position */
#define SDMMC_NISTER_BLKGE_Msk                (_UINT16_(0x1) << SDMMC_NISTER_BLKGE_Pos)            /* (SDMMC_NISTER) Block Gap Event Status Enable Mask */
#define SDMMC_NISTER_BLKGE(value)             (SDMMC_NISTER_BLKGE_Msk & (_UINT16_(value) << SDMMC_NISTER_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDMMC_NISTER register */
#define   SDMMC_NISTER_BLKGE_MASKED_Val       _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_BLKGE_ENABLED_Val      _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_BLKGE_MASKED             (SDMMC_NISTER_BLKGE_MASKED_Val << SDMMC_NISTER_BLKGE_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_BLKGE_ENABLED            (SDMMC_NISTER_BLKGE_ENABLED_Val << SDMMC_NISTER_BLKGE_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_DMAINT_Pos               _UINT16_(3)                                          /* (SDMMC_NISTER) DMA Interrupt Status Enable Position */
#define SDMMC_NISTER_DMAINT_Msk               (_UINT16_(0x1) << SDMMC_NISTER_DMAINT_Pos)           /* (SDMMC_NISTER) DMA Interrupt Status Enable Mask */
#define SDMMC_NISTER_DMAINT(value)            (SDMMC_NISTER_DMAINT_Msk & (_UINT16_(value) << SDMMC_NISTER_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDMMC_NISTER register */
#define   SDMMC_NISTER_DMAINT_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_DMAINT_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_DMAINT_MASKED            (SDMMC_NISTER_DMAINT_MASKED_Val << SDMMC_NISTER_DMAINT_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_DMAINT_ENABLED           (SDMMC_NISTER_DMAINT_ENABLED_Val << SDMMC_NISTER_DMAINT_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_BWRRDY_Pos               _UINT16_(4)                                          /* (SDMMC_NISTER) Buffer Write Ready Status Enable Position */
#define SDMMC_NISTER_BWRRDY_Msk               (_UINT16_(0x1) << SDMMC_NISTER_BWRRDY_Pos)           /* (SDMMC_NISTER) Buffer Write Ready Status Enable Mask */
#define SDMMC_NISTER_BWRRDY(value)            (SDMMC_NISTER_BWRRDY_Msk & (_UINT16_(value) << SDMMC_NISTER_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDMMC_NISTER register */
#define   SDMMC_NISTER_BWRRDY_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_BWRRDY_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_BWRRDY_MASKED            (SDMMC_NISTER_BWRRDY_MASKED_Val << SDMMC_NISTER_BWRRDY_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_BWRRDY_ENABLED           (SDMMC_NISTER_BWRRDY_ENABLED_Val << SDMMC_NISTER_BWRRDY_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_BRDRDY_Pos               _UINT16_(5)                                          /* (SDMMC_NISTER) Buffer Read Ready Status Enable Position */
#define SDMMC_NISTER_BRDRDY_Msk               (_UINT16_(0x1) << SDMMC_NISTER_BRDRDY_Pos)           /* (SDMMC_NISTER) Buffer Read Ready Status Enable Mask */
#define SDMMC_NISTER_BRDRDY(value)            (SDMMC_NISTER_BRDRDY_Msk & (_UINT16_(value) << SDMMC_NISTER_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDMMC_NISTER register */
#define   SDMMC_NISTER_BRDRDY_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_BRDRDY_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_BRDRDY_MASKED            (SDMMC_NISTER_BRDRDY_MASKED_Val << SDMMC_NISTER_BRDRDY_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_BRDRDY_ENABLED           (SDMMC_NISTER_BRDRDY_ENABLED_Val << SDMMC_NISTER_BRDRDY_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_CINS_Pos                 _UINT16_(6)                                          /* (SDMMC_NISTER) Card Insertion Status Enable Position */
#define SDMMC_NISTER_CINS_Msk                 (_UINT16_(0x1) << SDMMC_NISTER_CINS_Pos)             /* (SDMMC_NISTER) Card Insertion Status Enable Mask */
#define SDMMC_NISTER_CINS(value)              (SDMMC_NISTER_CINS_Msk & (_UINT16_(value) << SDMMC_NISTER_CINS_Pos)) /* Assigment of value for CINS in the SDMMC_NISTER register */
#define   SDMMC_NISTER_CINS_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_CINS_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_CINS_MASKED              (SDMMC_NISTER_CINS_MASKED_Val << SDMMC_NISTER_CINS_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_CINS_ENABLED             (SDMMC_NISTER_CINS_ENABLED_Val << SDMMC_NISTER_CINS_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_CREM_Pos                 _UINT16_(7)                                          /* (SDMMC_NISTER) Card Removal Status Enable Position */
#define SDMMC_NISTER_CREM_Msk                 (_UINT16_(0x1) << SDMMC_NISTER_CREM_Pos)             /* (SDMMC_NISTER) Card Removal Status Enable Mask */
#define SDMMC_NISTER_CREM(value)              (SDMMC_NISTER_CREM_Msk & (_UINT16_(value) << SDMMC_NISTER_CREM_Pos)) /* Assigment of value for CREM in the SDMMC_NISTER register */
#define   SDMMC_NISTER_CREM_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_CREM_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_CREM_MASKED              (SDMMC_NISTER_CREM_MASKED_Val << SDMMC_NISTER_CREM_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_CREM_ENABLED             (SDMMC_NISTER_CREM_ENABLED_Val << SDMMC_NISTER_CREM_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_CINT_Pos                 _UINT16_(8)                                          /* (SDMMC_NISTER) Card Interrupt Status Enable Position */
#define SDMMC_NISTER_CINT_Msk                 (_UINT16_(0x1) << SDMMC_NISTER_CINT_Pos)             /* (SDMMC_NISTER) Card Interrupt Status Enable Mask */
#define SDMMC_NISTER_CINT(value)              (SDMMC_NISTER_CINT_Msk & (_UINT16_(value) << SDMMC_NISTER_CINT_Pos)) /* Assigment of value for CINT in the SDMMC_NISTER register */
#define   SDMMC_NISTER_CINT_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISTER) Masked  */
#define   SDMMC_NISTER_CINT_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISTER) Enabled  */
#define SDMMC_NISTER_CINT_MASKED              (SDMMC_NISTER_CINT_MASKED_Val << SDMMC_NISTER_CINT_Pos) /* (SDMMC_NISTER) Masked Position  */
#define SDMMC_NISTER_CINT_ENABLED             (SDMMC_NISTER_CINT_ENABLED_Val << SDMMC_NISTER_CINT_Pos) /* (SDMMC_NISTER) Enabled Position  */
#define SDMMC_NISTER_Msk                      _UINT16_(0x01FF)                                     /* (SDMMC_NISTER) Register Mask  */

/* EMMC mode */
#define SDMMC_NISTER_EMMC_BOOTAR_Pos          _UINT16_(14)                                         /* (SDMMC_NISTER) Boot Acknowledge Received Status Enable Position */
#define SDMMC_NISTER_EMMC_BOOTAR_Msk          (_UINT16_(0x1) << SDMMC_NISTER_EMMC_BOOTAR_Pos)      /* (SDMMC_NISTER) Boot Acknowledge Received Status Enable Mask */
#define SDMMC_NISTER_EMMC_BOOTAR(value)       (SDMMC_NISTER_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDMMC_NISTER_EMMC_BOOTAR_Pos))
#define SDMMC_NISTER_EMMC_Msk                 _UINT16_(0x4000)                                      /* (SDMMC_NISTER_EMMC) Register Mask  */


/* -------- SDMMC_EISTER : (SDMMC Offset: 0x36) (R/W 16) Error Interrupt Status Enable -------- */
#define SDMMC_EISTER_RESETVALUE               _UINT16_(0x00)                                       /*  (SDMMC_EISTER) Error Interrupt Status Enable  Reset Value */

#define SDMMC_EISTER_CMDTEO_Pos               _UINT16_(0)                                          /* (SDMMC_EISTER) Command Timeout Error Status Enable Position */
#define SDMMC_EISTER_CMDTEO_Msk               (_UINT16_(0x1) << SDMMC_EISTER_CMDTEO_Pos)           /* (SDMMC_EISTER) Command Timeout Error Status Enable Mask */
#define SDMMC_EISTER_CMDTEO(value)            (SDMMC_EISTER_CMDTEO_Msk & (_UINT16_(value) << SDMMC_EISTER_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDMMC_EISTER register */
#define   SDMMC_EISTER_CMDTEO_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_CMDTEO_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_CMDTEO_MASKED            (SDMMC_EISTER_CMDTEO_MASKED_Val << SDMMC_EISTER_CMDTEO_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_CMDTEO_ENABLED           (SDMMC_EISTER_CMDTEO_ENABLED_Val << SDMMC_EISTER_CMDTEO_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_CMDCRC_Pos               _UINT16_(1)                                          /* (SDMMC_EISTER) Command CRC Error Status Enable Position */
#define SDMMC_EISTER_CMDCRC_Msk               (_UINT16_(0x1) << SDMMC_EISTER_CMDCRC_Pos)           /* (SDMMC_EISTER) Command CRC Error Status Enable Mask */
#define SDMMC_EISTER_CMDCRC(value)            (SDMMC_EISTER_CMDCRC_Msk & (_UINT16_(value) << SDMMC_EISTER_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDMMC_EISTER register */
#define   SDMMC_EISTER_CMDCRC_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_CMDCRC_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_CMDCRC_MASKED            (SDMMC_EISTER_CMDCRC_MASKED_Val << SDMMC_EISTER_CMDCRC_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_CMDCRC_ENABLED           (SDMMC_EISTER_CMDCRC_ENABLED_Val << SDMMC_EISTER_CMDCRC_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_CMDEND_Pos               _UINT16_(2)                                          /* (SDMMC_EISTER) Command End Bit Error Status Enable Position */
#define SDMMC_EISTER_CMDEND_Msk               (_UINT16_(0x1) << SDMMC_EISTER_CMDEND_Pos)           /* (SDMMC_EISTER) Command End Bit Error Status Enable Mask */
#define SDMMC_EISTER_CMDEND(value)            (SDMMC_EISTER_CMDEND_Msk & (_UINT16_(value) << SDMMC_EISTER_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDMMC_EISTER register */
#define   SDMMC_EISTER_CMDEND_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_CMDEND_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_CMDEND_MASKED            (SDMMC_EISTER_CMDEND_MASKED_Val << SDMMC_EISTER_CMDEND_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_CMDEND_ENABLED           (SDMMC_EISTER_CMDEND_ENABLED_Val << SDMMC_EISTER_CMDEND_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_CMDIDX_Pos               _UINT16_(3)                                          /* (SDMMC_EISTER) Command Index Error Status Enable Position */
#define SDMMC_EISTER_CMDIDX_Msk               (_UINT16_(0x1) << SDMMC_EISTER_CMDIDX_Pos)           /* (SDMMC_EISTER) Command Index Error Status Enable Mask */
#define SDMMC_EISTER_CMDIDX(value)            (SDMMC_EISTER_CMDIDX_Msk & (_UINT16_(value) << SDMMC_EISTER_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDMMC_EISTER register */
#define   SDMMC_EISTER_CMDIDX_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_CMDIDX_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_CMDIDX_MASKED            (SDMMC_EISTER_CMDIDX_MASKED_Val << SDMMC_EISTER_CMDIDX_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_CMDIDX_ENABLED           (SDMMC_EISTER_CMDIDX_ENABLED_Val << SDMMC_EISTER_CMDIDX_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_DATTEO_Pos               _UINT16_(4)                                          /* (SDMMC_EISTER) Data Timeout Error Status Enable Position */
#define SDMMC_EISTER_DATTEO_Msk               (_UINT16_(0x1) << SDMMC_EISTER_DATTEO_Pos)           /* (SDMMC_EISTER) Data Timeout Error Status Enable Mask */
#define SDMMC_EISTER_DATTEO(value)            (SDMMC_EISTER_DATTEO_Msk & (_UINT16_(value) << SDMMC_EISTER_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDMMC_EISTER register */
#define   SDMMC_EISTER_DATTEO_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_DATTEO_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_DATTEO_MASKED            (SDMMC_EISTER_DATTEO_MASKED_Val << SDMMC_EISTER_DATTEO_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_DATTEO_ENABLED           (SDMMC_EISTER_DATTEO_ENABLED_Val << SDMMC_EISTER_DATTEO_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_DATCRC_Pos               _UINT16_(5)                                          /* (SDMMC_EISTER) Data CRC Error Status Enable Position */
#define SDMMC_EISTER_DATCRC_Msk               (_UINT16_(0x1) << SDMMC_EISTER_DATCRC_Pos)           /* (SDMMC_EISTER) Data CRC Error Status Enable Mask */
#define SDMMC_EISTER_DATCRC(value)            (SDMMC_EISTER_DATCRC_Msk & (_UINT16_(value) << SDMMC_EISTER_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDMMC_EISTER register */
#define   SDMMC_EISTER_DATCRC_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_DATCRC_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_DATCRC_MASKED            (SDMMC_EISTER_DATCRC_MASKED_Val << SDMMC_EISTER_DATCRC_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_DATCRC_ENABLED           (SDMMC_EISTER_DATCRC_ENABLED_Val << SDMMC_EISTER_DATCRC_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_DATEND_Pos               _UINT16_(6)                                          /* (SDMMC_EISTER) Data End Bit Error Status Enable Position */
#define SDMMC_EISTER_DATEND_Msk               (_UINT16_(0x1) << SDMMC_EISTER_DATEND_Pos)           /* (SDMMC_EISTER) Data End Bit Error Status Enable Mask */
#define SDMMC_EISTER_DATEND(value)            (SDMMC_EISTER_DATEND_Msk & (_UINT16_(value) << SDMMC_EISTER_DATEND_Pos)) /* Assigment of value for DATEND in the SDMMC_EISTER register */
#define   SDMMC_EISTER_DATEND_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_DATEND_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_DATEND_MASKED            (SDMMC_EISTER_DATEND_MASKED_Val << SDMMC_EISTER_DATEND_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_DATEND_ENABLED           (SDMMC_EISTER_DATEND_ENABLED_Val << SDMMC_EISTER_DATEND_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_CURLIM_Pos               _UINT16_(7)                                          /* (SDMMC_EISTER) Current Limit Error Status Enable Position */
#define SDMMC_EISTER_CURLIM_Msk               (_UINT16_(0x1) << SDMMC_EISTER_CURLIM_Pos)           /* (SDMMC_EISTER) Current Limit Error Status Enable Mask */
#define SDMMC_EISTER_CURLIM(value)            (SDMMC_EISTER_CURLIM_Msk & (_UINT16_(value) << SDMMC_EISTER_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDMMC_EISTER register */
#define   SDMMC_EISTER_CURLIM_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_CURLIM_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_CURLIM_MASKED            (SDMMC_EISTER_CURLIM_MASKED_Val << SDMMC_EISTER_CURLIM_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_CURLIM_ENABLED           (SDMMC_EISTER_CURLIM_ENABLED_Val << SDMMC_EISTER_CURLIM_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_ACMD_Pos                 _UINT16_(8)                                          /* (SDMMC_EISTER) Auto CMD Error Status Enable Position */
#define SDMMC_EISTER_ACMD_Msk                 (_UINT16_(0x1) << SDMMC_EISTER_ACMD_Pos)             /* (SDMMC_EISTER) Auto CMD Error Status Enable Mask */
#define SDMMC_EISTER_ACMD(value)              (SDMMC_EISTER_ACMD_Msk & (_UINT16_(value) << SDMMC_EISTER_ACMD_Pos)) /* Assigment of value for ACMD in the SDMMC_EISTER register */
#define   SDMMC_EISTER_ACMD_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_ACMD_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_ACMD_MASKED              (SDMMC_EISTER_ACMD_MASKED_Val << SDMMC_EISTER_ACMD_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_ACMD_ENABLED             (SDMMC_EISTER_ACMD_ENABLED_Val << SDMMC_EISTER_ACMD_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_ADMA_Pos                 _UINT16_(9)                                          /* (SDMMC_EISTER) ADMA Error Status Enable Position */
#define SDMMC_EISTER_ADMA_Msk                 (_UINT16_(0x1) << SDMMC_EISTER_ADMA_Pos)             /* (SDMMC_EISTER) ADMA Error Status Enable Mask */
#define SDMMC_EISTER_ADMA(value)              (SDMMC_EISTER_ADMA_Msk & (_UINT16_(value) << SDMMC_EISTER_ADMA_Pos)) /* Assigment of value for ADMA in the SDMMC_EISTER register */
#define   SDMMC_EISTER_ADMA_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_EISTER) Masked  */
#define   SDMMC_EISTER_ADMA_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_EISTER) Enabled  */
#define SDMMC_EISTER_ADMA_MASKED              (SDMMC_EISTER_ADMA_MASKED_Val << SDMMC_EISTER_ADMA_Pos) /* (SDMMC_EISTER) Masked Position  */
#define SDMMC_EISTER_ADMA_ENABLED             (SDMMC_EISTER_ADMA_ENABLED_Val << SDMMC_EISTER_ADMA_Pos) /* (SDMMC_EISTER) Enabled Position  */
#define SDMMC_EISTER_Msk                      _UINT16_(0x03FF)                                     /* (SDMMC_EISTER) Register Mask  */

/* EMMC mode */
#define SDMMC_EISTER_EMMC_BOOTAE_Pos          _UINT16_(12)                                         /* (SDMMC_EISTER) Boot Acknowledge Error Status Enable Position */
#define SDMMC_EISTER_EMMC_BOOTAE_Msk          (_UINT16_(0x1) << SDMMC_EISTER_EMMC_BOOTAE_Pos)      /* (SDMMC_EISTER) Boot Acknowledge Error Status Enable Mask */
#define SDMMC_EISTER_EMMC_BOOTAE(value)       (SDMMC_EISTER_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDMMC_EISTER_EMMC_BOOTAE_Pos))
#define SDMMC_EISTER_EMMC_Msk                 _UINT16_(0x1000)                                      /* (SDMMC_EISTER_EMMC) Register Mask  */


/* -------- SDMMC_NISIER : (SDMMC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable -------- */
#define SDMMC_NISIER_RESETVALUE               _UINT16_(0x00)                                       /*  (SDMMC_NISIER) Normal Interrupt Signal Enable  Reset Value */

